{"modelTopology": {"model_config": {"config": {"name": "sequential_8", "layers": [{"config": {"batch_input_shape": [null, 28, 28, 1], "padding": "same", "data_format": "channels_last", "name": "conv2d_50", "activation": "relu", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "filters": 32, "kernel_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "activity_regularizer": null, "strides": [1, 1], "use_bias": true, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"scale": true, "name": "batch_normalization_43", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "gamma_regularizer": null, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "beta_regularizer": null, "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "same", "data_format": "channels_last", "name": "conv2d_51", "bias_regularizer": null, "trainable": true, "filters": 32, "kernel_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "activity_regularizer": null, "strides": [1, 1], "use_bias": true, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"scale": true, "name": "batch_normalization_44", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "gamma_regularizer": null, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "beta_regularizer": null, "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "same", "data_format": "channels_last", "name": "conv2d_52", "bias_regularizer": null, "trainable": true, "filters": 32, "kernel_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_size": [5, 5], "activity_regularizer": null, "strides": [1, 1], "use_bias": true, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"scale": true, "name": "batch_normalization_45", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "gamma_regularizer": null, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "beta_regularizer": null, "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"batch_input_shape": [null, 28, 28, 1], "padding": "same", "data_format": "channels_last", "name": "conv2d_53", "activation": "relu", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "filters": 64, "kernel_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "activity_regularizer": null, "strides": [1, 1], "use_bias": true, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"scale": true, "name": "batch_normalization_46", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "gamma_regularizer": null, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "beta_regularizer": null, "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "same", "data_format": "channels_last", "name": "conv2d_54", "bias_regularizer": null, "trainable": true, "filters": 64, "kernel_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "activity_regularizer": null, "strides": [1, 1], "use_bias": true, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"scale": true, "name": "batch_normalization_47", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "gamma_regularizer": null, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "beta_regularizer": null, "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "same", "data_format": "channels_last", "name": "conv2d_55", "bias_regularizer": null, "trainable": true, "filters": 64, "kernel_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_size": [5, 5], "activity_regularizer": null, "strides": [1, 1], "use_bias": true, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"scale": true, "name": "batch_normalization_48", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "gamma_regularizer": null, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "beta_regularizer": null, "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "same", "data_format": "channels_last", "name": "conv2d_56", "bias_regularizer": null, "trainable": true, "filters": 32, "kernel_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "activity_regularizer": null, "strides": [1, 1], "use_bias": true, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"trainable": true, "noise_shape": null, "rate": 0.4, "name": "dropout_22", "seed": null}, "class_name": "Dropout"}, {"config": {"trainable": true, "data_format": "channels_last", "name": "flatten_8"}, "class_name": "Flatten"}, {"config": {"trainable": true, "noise_shape": null, "rate": 0.4, "name": "dropout_23", "seed": null}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "name": "dense_15", "bias_regularizer": null, "trainable": true, "units": 128, "kernel_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "use_bias": true, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"trainable": true, "noise_shape": null, "rate": 0.4, "name": "dropout_24", "seed": null}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "name": "dense_16", "bias_regularizer": null, "trainable": true, "units": 10, "kernel_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "use_bias": true, "activation": "softmax", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}]}, "class_name": "Sequential"}, "training_config": {"sample_weight_mode": null, "loss_weights": null, "metrics": ["accuracy"], "loss": "categorical_crossentropy", "optimizer_config": {"config": {"rho": 0.8999999761581421, "lr": 9.999999747378752e-06, "epsilon": 1e-08, "decay": 0.0}, "class_name": "RMSprop"}}, "keras_version": "2.2.4", "backend": "tensorflow"}, "weightsManifest": [{"weights": [{"shape": [32], "dtype": "float32", "name": "batch_normalization_43/gamma"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_43/beta"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_43/moving_mean"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_43/moving_variance"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_44/gamma"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_44/beta"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_44/moving_mean"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_44/moving_variance"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_45/gamma"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_45/beta"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_45/moving_mean"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_45/moving_variance"}, {"shape": [64], "dtype": "float32", "name": "batch_normalization_46/gamma"}, {"shape": [64], "dtype": "float32", "name": "batch_normalization_46/beta"}, {"shape": [64], "dtype": "float32", "name": "batch_normalization_46/moving_mean"}, {"shape": [64], "dtype": "float32", "name": "batch_normalization_46/moving_variance"}, {"shape": [64], "dtype": "float32", "name": "batch_normalization_47/gamma"}, {"shape": [64], "dtype": "float32", "name": "batch_normalization_47/beta"}, {"shape": [64], "dtype": "float32", "name": "batch_normalization_47/moving_mean"}, {"shape": [64], "dtype": "float32", "name": "batch_normalization_47/moving_variance"}, {"shape": [64], "dtype": "float32", "name": "batch_normalization_48/gamma"}, {"shape": [64], "dtype": "float32", "name": "batch_normalization_48/beta"}, {"shape": [64], "dtype": "float32", "name": "batch_normalization_48/moving_mean"}, {"shape": [64], "dtype": "float32", "name": "batch_normalization_48/moving_variance"}, {"shape": [3, 3, 1, 32], "dtype": "float32", "name": "conv2d_50/kernel"}, {"shape": [32], "dtype": "float32", "name": "conv2d_50/bias"}, {"shape": [3, 3, 32, 32], "dtype": "float32", "name": "conv2d_51/kernel"}, {"shape": [32], "dtype": "float32", "name": "conv2d_51/bias"}, {"shape": [5, 5, 32, 32], "dtype": "float32", "name": "conv2d_52/kernel"}, {"shape": [32], "dtype": "float32", "name": "conv2d_52/bias"}, {"shape": [3, 3, 32, 64], "dtype": "float32", "name": "conv2d_53/kernel"}, {"shape": [64], "dtype": "float32", "name": "conv2d_53/bias"}, {"shape": [3, 3, 64, 64], "dtype": "float32", "name": "conv2d_54/kernel"}, {"shape": [64], "dtype": "float32", "name": "conv2d_54/bias"}, {"shape": [5, 5, 64, 64], "dtype": "float32", "name": "conv2d_55/kernel"}, {"shape": [64], "dtype": "float32", "name": "conv2d_55/bias"}, {"shape": [3, 3, 64, 32], "dtype": "float32", "name": "conv2d_56/kernel"}, {"shape": [32], "dtype": "float32", "name": "conv2d_56/bias"}, {"shape": [25088, 128], "dtype": "float32", "name": "dense_15/kernel"}, {"shape": [128], "dtype": "float32", "name": "dense_15/bias"}, {"shape": [128, 10], "dtype": "float32", "name": "dense_16/kernel"}, {"shape": [10], "dtype": "float32", "name": "dense_16/bias"}], "paths": ["group1-shard1of4", "group1-shard2of4", "group1-shard3of4", "group1-shard4of4"]}]}